HELYXcore-4.4.0/examples/legacy/compressible/rhoCentralFoam/LadenburgJet60psi/system/materialProperties
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      materialProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

materialType    fluid;
muModel         muSutherland;
kappaModel      kappaSutherland;
thermodynamics  hConst;
equationOfState perfectGas;
energy          sensibleInternalEnergy;
molWeight       28.96;

thermodynamicsCoeffs
{
    Cp              1004.5;
    Hf              0;
}
muModelCoeffs
{
    As              1.458e-06;
    Ts              110.4;
    Pr              1;
}


// ************************************************************************* //
