HELYXcore-4.4.0/examples/legacy/compressible/rhoCentralFoam/LadenburgJet60psi/system/sample
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      sample;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type sets;
libs            ("libsampling.so");

interpolationScheme cellPointFace;

writeFormat     raw;

sampleSets
(
    face
    {
        name    cone25;
        axis    x;
        start   (0 0 0);
        end     (0.09208087 0.042939 0);
        nPoints 92;
    }
    face
    {
        name    cone55;
        axis    x;
        start   (0.09208087 0.042939 0);
        end     (0.153683 0.13092 0);
        nPoints 61;
    }
    face
    {
        name    base;
        axis    x;
        start   (0.153683 0.13092 0);
        end     (0.193675 0.13092 0);
        nPoints 40;
    }
);

fields          ( p wallHeatTransRate );


// ************************************************************************* //
